test/reserve_additional_xml.xml

<soapenv:Envelope xmlns:type="http://schemas.ogf.org/nsi/2013/07/connection/types"
   xmlns:head="http://schemas.ogf.org/nsi/2013/07/framework/headers"
   xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <head:nsiHeader>
         <protocolVersion>2.0</protocolVersion>
         <correlationId>urn:uuid:f8a23b90-832b-0130-d364-20c9d0879def</correlationId>
         <requesterNSA>urn:ogf:network:nsa:surfnet-nsi-requester</requesterNSA>
         <providerNSA>nl.surfnet</providerNSA>
         <replyTo>http://localhost:9000</replyTo>
      </head:nsiHeader>
   </soapenv:Header>
   <soapenv:Body>
      <type:reserve>
         <test>Hacker</test>
         <globalReservationId />
         <description>My first reservation</description>
         <criteria version="">
            <schedule>
               <startTime>2013-04-03T12:15:29.731+02:00</startTime>
               <endTime>2013-04-03T12:25:29.798+02:00</endTime>
            </schedule>
            <bandwidth>100</bandwidth>
            <serviceAttributes>
            </serviceAttributes>
            <path>
               <directionality>Bidirectional</directionality>
               <symmetric></symmetric>
               <sourceSTP>
                  <networkId></networkId>
                  <localId></localId>
                  <labels></labels>
               </sourceSTP>
               <destSTP>
                  <networkId></networkId>
                  <localId></localId>
                  <labels></labels>
               </destSTP>
            </path>
         </criteria>
      </type:reserve>
   </soapenv:Body>
</soapenv:Envelope>
